Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_flash.h
#define    FLASH_DEPCR_ERTYPE_Pos                                   (8U)
#define    FLASH_DEPCR_ERTYPE_Msk                                   (0x3U << FLASH_DEPCR_ERTYPE_Pos)
#define    FLASH_DEPCR_ERTYPE                                       FLASH_DEPCR_ERTYPE_Msk

#define    FLASH_DEPCR_PREQ_Pos                                     (1U)
#define    FLASH_DEPCR_PREQ_Msk                                     (0x1U << FLASH_DEPCR_PREQ_Pos)
#define    FLASH_DEPCR_PREQ                                         FLASH_DEPCR_PREQ_Msk

#define    FLASH_DEPCR_EREQ_Pos                                     (0U)
#define    FLASH_DEPCR_EREQ_Msk                                     (0x1U << FLASH_DEPCR_EREQ_Pos)
#define    FLASH_DEPCR_EREQ                                         FLASH_DEPCR_EREQ_Msk

#define    FLASH_DIER_LVIE_Pos                                      (12U)
#define    FLASH_DIER_LVIE_Msk                                      (0x1U << FLASH_DIER_LVIE_Pos)
#define    FLASH_DIER_LVIE                                          FLASH_DIER_LVIE_Msk

#define    FLASH_DIER_OPTIE_Pos                                     (11U)
#define    FLASH_DIER_OPTIE_Msk                                     (0x1U << FLASH_DIER_OPTIE_Pos)
#define    FLASH_DIER_OPTIE                                         FLASH_DIER_OPTIE_Msk

#define    FLASH_DIER_AUTHIE_Pos                                    (10U)
#define    FLASH_DIER_AUTHIE_Msk                                    (0x1U << FLASH_DIER_AUTHIE_Pos)
#define    FLASH_DIER_AUTHIE                                        FLASH_DIER_AUTHIE_Msk

#define    FLASH_DIER_KEYIE_Pos                                     (9U)
#define    FLASH_DIER_KEYIE_Msk                                     (0x1U << FLASH_DIER_KEYIE_Pos)
#define    FLASH_DIER_KEYIE                                         FLASH_DIER_KEYIE_Msk

#define    FLASH_DIER_CKIE_Pos                                      (8U)
#define    FLASH_DIER_CKIE_Msk                                      (0x1U << FLASH_DIER_CKIE_Pos)
#define    FLASH_DIER_CKIE                                          FLASH_DIER_CKIE_Msk

#define    FLASH_DIER_PRDIE_Pos                                     (1U)
#define    FLASH_DIER_PRDIE_Msk                                     (0x1U << FLASH_DIER_PRDIE_Pos)
#define    FLASH_DIER_PRDIE                                         FLASH_DIER_PRDIE_Msk

#define    FLASH_DIER_ERDIE_Pos                                     (0U)
#define    FLASH_DIER_ERDIE_Msk                                     (0x1U << FLASH_DIER_ERDIE_Pos)
#define    FLASH_DIER_ERDIE                                         FLASH_DIER_ERDIE_Msk

#define    FLASH_DISR_CONF_Pos                                      (31U)
#define    FLASH_DISR_CONF_Msk                                      (0x1U << FLASH_DISR_CONF_Pos)
#define    FLASH_DISR_CONF                                          FLASH_DISR_CONF_Msk

#define    FLASH_DISR_KEYSTA_Pos                                    (17U)
#define    FLASH_DISR_KEYSTA_Msk                                    (0x7U << FLASH_DISR_KEYSTA_Pos)
#define    FLASH_DISR_KEYSTA                                        FLASH_DISR_KEYSTA_Msk

#define    FLASH_DISR_LVERR_Pos                                     (12U)
#define    FLASH_DISR_LVERR_Msk                                     (0x1U << FLASH_DISR_LVERR_Pos)
#define    FLASH_DISR_LVERR                                         FLASH_DISR_LVERR_Msk

#define    FLASH_DISR_AUTHERR_Pos                                   (10U)
#define    FLASH_DISR_AUTHERR_Msk                                   (0x1U << FLASH_DISR_AUTHERR_Pos)
#define    FLASH_DISR_AUTHERR                                       FLASH_DISR_AUTHERR_Msk

#define    FLASH_DISR_KEYERR_Pos                                    (9U)
#define    FLASH_DISR_KEYERR_Msk                                    (0x1U << FLASH_DISR_KEYERR_Pos)
#define    FLASH_DISR_KEYERR                                        FLASH_DISR_KEYERR_Msk

#define    FLASH_DISR_CKERR_Pos                                     (8U)
#define    FLASH_DISR_CKERR_Msk                                     (0x1U << FLASH_DISR_CKERR_Pos)
#define    FLASH_DISR_CKERR                                         FLASH_DISR_CKERR_Msk

#define    FLASH_DISR_PRD_Pos                                       (1U)
#define    FLASH_DISR_PRD_Msk                                       (0x1U << FLASH_DISR_PRD_Pos)
#define    FLASH_DISR_PRD                                           FLASH_DISR_PRD_Msk

#define    FLASH_DISR_ERD_Pos                                       (0U)
#define    FLASH_DISR_ERD_Msk                                       (0x1U << FLASH_DISR_ERD_Pos)
#define    FLASH_DISR_ERD                                           FLASH_DISR_ERD_Msk
  
#define    FL_FLASH_INFORMATION1_REGIN                              (0x1U << 17U)
#define    FL_FLASH_INFORMATION2_REGIN                              (0x1U << 18U)
#define    FL_FLASH_BLOCK_0                                         (0x1U << 0U)
#define    FL_FLASH_BLOCK_1                                         (0x1U << 1U)
#define    FL_FLASH_BLOCK_2                                         (0x1U << 2U)
#define    FL_FLASH_BLOCK_3                                         (0x1U << 3U)
#define    FL_FLASH_BLOCK_4                                         (0x1U << 4U)
#define    FL_FLASH_BLOCK_5                                         (0x1U << 5U)
#define    FL_FLASH_BLOCK_6                                         (0x1U << 6U)
#define    FL_FLASH_BLOCK_7                                         (0x1U << 7U)
#define    FL_FLASH_BLOCK_8                                         (0x1U << 8U)
#define    FL_FLASH_BLOCK_9                                         (0x1U << 9U)
#define    FL_FLASH_BLOCK_10                                        (0x1U << 10U)
#define    FL_FLASH_BLOCK_11                                        (0x1U << 11U)
#define    FL_FLASH_BLOCK_12                                        (0x1U << 12U)
#define    FL_FLASH_BLOCK_13                                        (0x1U << 13U)
#define    FL_FLASH_BLOCK_14                                        (0x1U << 14U)
#define    FL_FLASH_BLOCK_15                                        (0x1U << 15U)
#define    FL_FLASH_LOCK_ALL                                        (0x0U << 0U)
#define    FL_FLASH_LOCK_SOFTWARE                                   (0x2U << 0U)
#define    FL_FLASH_LOCK_NONE                                       (0x3U << 0U)
#define    FL_FLASH_BOOTSWAP_ENABLE                                 (0x2U << 8U)
#define    FL_FLASH_BOOTSWAP_DISABLE                                (0x0U << 8U)
#define    FL_FLASH_APPCODE_LOCK_ENABLE                             (0x2U << 2U)
#define    FL_FLASH_APPCODE_LOCK_DISABLE                            (0x0U << 2U)
#define    FL_FLASH_DEBUG_READ_ENABLE                               (0x2U << 0U)
#define    FL_FLASH_DEBUG_READ_DISABLE                              (0x0U << 0U)


#define    FL_FLASH_ERASE_KEY                                     (0x96969696U)
#define    FL_FLASH_CHIP_ERASE_KEY                                (0x7D7D7D7DU)
#define    FL_FLASH_PGAE_ERASE_KEY                                (0xEAEAEAEAU)
#define    FL_FLASH_SECTOR_ERASE_KEY                              (0x3C3C3C3CU)
#define    FL_FLASH_ERASE_REQUEST                                 (0x1234ABCDU)
#define    FL_FLASH_PROGRAM_KEY1                                  (0xA5A5A5A5U)
#define    FL_FLASH_PROGRAM_KEY2                                  (0xF1F1F1F1U)
/*8M*/                                                            
#define    FL_FLASH_ERASE_TIMEOUT                                 (0x0000FFFFU)
#define    FL_FLASH_HALFWORD_ADDRS_ALIGN                          (0x00000002U)
#define    FL_FLASH_WORD_ADDRS_ALIGN                              (0x00000004U)

