Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_flash.h
/**
  * @brief    
  * @rmtoll   CIER    KEYIE    FL_FLASH_IsEnabledIT_KeyErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_KeyErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CIER, FLASH_CIER_KEYIE_Msk) == FLASH_CIER_KEYIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    CKIE    FL_FLASH_EnableIT_ClockErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_ClockErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->CIER, FLASH_CIER_CKIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    CKIE    FL_FLASH_DisableIT_ClockErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_ClockErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CIER, FLASH_CIER_CKIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    CKIE    FL_FLASH_IsEnabledIT_ClockErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_ClockErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CIER, FLASH_CIER_CKIE_Msk) == FLASH_CIER_CKIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    PRDIE    FL_FLASH_EnableIT_ProgramCompleteInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_ProgramCompleteInCodeFLASH(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->CIER, FLASH_CIER_PRDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    PRDIE    FL_FLASH_DisableIT_ProgramCompleteInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_ProgramCompleteInCodeFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CIER, FLASH_CIER_PRDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    PRDIE    FL_FLASH_IsEnabledIT_ProgramCompleteInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_ProgramCompleteInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CIER, FLASH_CIER_PRDIE_Msk) == FLASH_CIER_PRDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    ERDIE    FL_FLASH_EnableIT_EraseCompleteInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_EraseCompleteInCodeFLASH(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->CIER, FLASH_CIER_ERDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    ERDIE    FL_FLASH_DisableIT_EraseCompleteInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_EraseCompleteInCodeFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->CIER, FLASH_CIER_ERDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CIER    ERDIE    FL_FLASH_IsEnabledIT_EraseCompleteInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_EraseCompleteInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CIER, FLASH_CIER_ERDIE_Msk) == FLASH_CIER_ERDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CISR    CONF    FL_FLASH_IsActiveFlag_TestModeInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_TestModeInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CISR, FLASH_CISR_CONF_Msk) == (FLASH_CISR_CONF_Msk));
}

/**
  * @brief    
  * @rmtoll   CISR    KEYSTA    FL_FLASH_GetFLASHLockStatusInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_KEY_STATUS_LOCK
  *           @arg @ref FL_FLASH_KEY_STATUS_ALL_ERASE
  *           @arg @ref FL_FLASH_KEY_STATUS_PAGE_ERASE
  *           @arg @ref FL_FLASH_KEY_STATUS_PROGRAM
  *           @arg @ref FL_FLASH_KEY_STATUS_ERROR
  *           @arg @ref FL_FLASH_KEY_STATUS_SECTOR_ERASE
  */
__STATIC_INLINE uint32_t FL_FLASH_GetFLASHLockStatusInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CISR, FLASH_CISR_KEYSTA_Msk));
}

/**
  * @brief    
  * @rmtoll   CISR    LVERR    FL_FLASH_IsActiveFlag_SVDVoltagedetectFallingErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_SVDVoltagedetectFallingErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CISR, FLASH_CISR_LVERR_Msk) == (FLASH_CISR_LVERR_Msk));
}

/**
  * @brief    
  * @rmtoll   CISR    LVERR    FL_FLASH_ClearFlag_SVDVoltagedetectFallingErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_SVDVoltagedetectFallingErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->CISR, FLASH_CISR_LVERR_Msk);
}

/**
  * @brief    
  * @rmtoll   CISR    OPTERR    FL_FLASH_IsActiveFlag_OPTProgramErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_OPTProgramErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CISR, FLASH_CISR_OPTERR_Msk) == (FLASH_CISR_OPTERR_Msk));
}

/**
  * @brief    
  * @rmtoll   CISR    OPTERR    FL_FLASH_ClearFlag_OPTProgramErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_OPTProgramErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->CISR, FLASH_CISR_OPTERR_Msk);
}

/**
  * @brief    
  * @rmtoll   CISR    AUTHERR    FL_FLASH_IsActiveFlag_AuthenticationErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_AuthenticationErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CISR, FLASH_CISR_AUTHERR_Msk) == (FLASH_CISR_AUTHERR_Msk));
}

/**
  * @brief    
  * @rmtoll   CISR    AUTHERR    FL_FLASH_ClearFlag_AuthenticationErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_AuthenticationErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->CISR, FLASH_CISR_AUTHERR_Msk);
}

/**
  * @brief    
  * @rmtoll   CISR    KEYERR    FL_FLASH_IsActiveFlag_KeyErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_KeyErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CISR, FLASH_CISR_KEYERR_Msk) == (FLASH_CISR_KEYERR_Msk));
}

/**
  * @brief    
  * @rmtoll   CISR    KEYERR    FL_FLASH_ClearFlag_KeyErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_KeyErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->CISR, FLASH_CISR_KEYERR_Msk);
}

/**
  * @brief    
  * @rmtoll   CISR    CKERR    FL_FLASH_IsActiveFlag_ClockErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ClockErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CISR, FLASH_CISR_CKERR_Msk) == (FLASH_CISR_CKERR_Msk));
}

/**
  * @brief    
  * @rmtoll   CISR    CKERR    FL_FLASH_ClearFlag_ClockErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ClockErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->CISR, FLASH_CISR_CKERR_Msk);
}

/**
  * @brief    
  * @rmtoll   CISR    PRD    FL_FLASH_IsActiveFlag_ProgramCompleteInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ProgramCompleteInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CISR, FLASH_CISR_PRD_Msk) == (FLASH_CISR_PRD_Msk));
}

/**
  * @brief    
  * @rmtoll   CISR    PRD    FL_FLASH_ClearFlag_ProgramCompleteInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ProgramCompleteInCodeFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->CISR, FLASH_CISR_PRD_Msk);
}

/**
  * @brief    
  * @rmtoll   CISR    ERD    FL_FLASH_IsActiveFlag_EraseCompleteInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_EraseCompleteInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->CISR, FLASH_CISR_ERD_Msk) == (FLASH_CISR_ERD_Msk));
}

/**
  * @brief    
  * @rmtoll   CISR    ERD    FL_FLASH_ClearFlag_EraseCompleteInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_EraseCompleteInCodeFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->CISR, FLASH_CISR_ERD_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCSR    DD    FL_FLASH_IsActiveFlag_ECCDetectionInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ECCDetectionInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCSR, FLASH_ECCSR_DD_Msk) == (FLASH_ECCSR_DD_Msk));
}

/**
  * @brief    
  * @rmtoll   ECCSR    DD    FL_FLASH_ClearFlag_ECCDetectionInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ECCDetectionInDataFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->ECCSR, FLASH_ECCSR_DD_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCSR    CD    FL_FLASH_IsActiveFlag_ECCCorrectionInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ECCCorrectionInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCSR, FLASH_ECCSR_CD_Msk) == (FLASH_ECCSR_CD_Msk));
}

/**
  * @brief    
  * @rmtoll   ECCSR    CD    FL_FLASH_ClearFlag_ECCCorrectionInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ECCCorrectionInDataFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->ECCSR, FLASH_ECCSR_CD_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCSR    DC    FL_FLASH_IsActiveFlag_ECCDetectionInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ECCDetectionInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCSR, FLASH_ECCSR_DC_Msk) == (FLASH_ECCSR_DC_Msk));
}

/**
  * @brief    
  * @rmtoll   ECCSR    DC    FL_FLASH_ClearFlag_ECCDetectionInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ECCDetectionInCodeFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->ECCSR, FLASH_ECCSR_DC_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCSR    CC    FL_FLASH_IsActiveFlag_ECCCorrectionInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ECCCorrectionInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCSR, FLASH_ECCSR_CC_Msk) == (FLASH_ECCSR_CC_Msk));
}

/**
  * @brief    
  * @rmtoll   ECCSR    CC    FL_FLASH_ClearFlag_ECCCorrectionInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_ClearFlag_ECCCorrectionInCodeFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->ECCSR, FLASH_ECCSR_CC_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCSR    BE    FL_FLASH_IsActiveFlag_ECCBitErrorInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsActiveFlag_ECCBitErrorInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCSR, FLASH_ECCSR_BE_Msk) == (FLASH_ECCSR_BE_Msk));
}

/**
  * @brief    
  * @rmtoll   ECCIER    DDIE    FL_FLASH_EnableIT_ECCDetectionInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_ECCDetectionInDataFLASH(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->ECCIER, FLASH_ECCIER_DDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCIER    DDIE    FL_FLASH_DisableIT_ECCDetectionInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_ECCDetectionInDataFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->ECCIER, FLASH_ECCIER_DDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCIER    DDIE    FL_FLASH_IsEnabledIT_ECCDetectionInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_ECCDetectionInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCIER, FLASH_ECCIER_DDIE_Msk) == FLASH_ECCIER_DDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCIER    CDIE    FL_FLASH_EnableIT_ECCCorrectionInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_ECCCorrectionInDataFLASH(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->ECCIER, FLASH_ECCIER_CDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCIER    CDIE    FL_FLASH_DisableIT_ECCCorrectionInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_ECCCorrectionInDataFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->ECCIER, FLASH_ECCIER_CDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCIER    CDIE    FL_FLASH_IsEnabledIT_ECCCorrectionInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_ECCCorrectionInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCIER, FLASH_ECCIER_CDIE_Msk) == FLASH_ECCIER_CDIE_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCIER    DCIE    FL_FLASH_EnableIT_ECCDetectionInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_ECCDetectionInCodeFLASH(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->ECCIER, FLASH_ECCIER_DCIE_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCIER    DCIE    FL_FLASH_DisableIT_ECCDetectionInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_ECCDetectionInCodeFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->ECCIER, FLASH_ECCIER_DCIE_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCIER    DCIE    FL_FLASH_IsEnabledIT_ECCDetectionInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_ECCDetectionInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCIER, FLASH_ECCIER_DCIE_Msk) == FLASH_ECCIER_DCIE_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCIER    CCIE    FL_FLASH_EnableIT_ECCCorrectionInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_ECCCorrectionInCodeFLASH(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->ECCIER, FLASH_ECCIER_CCIE_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCIER    CCIE    FL_FLASH_DisableIT_ECCCorrectionInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_ECCCorrectionInCodeFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->ECCIER, FLASH_ECCIER_CCIE_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCIER    CCIE    FL_FLASH_IsEnabledIT_ECCCorrectionInCodeFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_ECCCorrectionInCodeFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCIER, FLASH_ECCIER_CCIE_Msk) == FLASH_ECCIER_CCIE_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCEAR    ERR_ADDR    FL_FLASH_ReadCodeECCErrorAddress
  * @param    FLASHx FLASH instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_FLASH_ReadCodeECCErrorAddress(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCEAR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    
  * @rmtoll   ECCEAR    ERR_ADDR    FL_FLASH_ReadDataECCErrorAddress
  * @param    FLASHx FLASH instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_FLASH_ReadDataECCErrorAddress(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ECCEAR, (0xfffU << 0U)) >> 20U);
}

/**
  * @brief    
  * @rmtoll   ECCCR    CECCR    FL_FLASH_EnableCECC
  * @param    FLASHx FLASH instance
  * @param    key 
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableCECC(FLASH_Type* FLASHx)
{
    MODIFY_REG(FLASHx->ECCCR, (0xffU << 8U), (0x00 << 8U));
}

/**
  * @brief    
  * @rmtoll   ECCCR    CECCR    FL_FLASH_DisableCECC
  * @param    FLASHx FLASH instance
  * @retval   
  */
__STATIC_INLINE void FL_FLASH_DisableCECC(FLASH_Type* FLASHx)
{
    MODIFY_REG(FLASHx->ECCCR, (0xffU << 8U), (0xCC << 8U));
}

/**
  * @brief    
  * @rmtoll   ECCCR    CECCR    FL_I2C_Master_IsEnabledTimeout
  * @param    I2Cx I2C instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledCECC(FLASH_Type* FLASHx)
{
    return (uint32_t)READ_BIT(FLASHx->ECCCR, FLASH_ECCCR_CECCR_Msk);
}

/**
  * @brief    
  * @rmtoll   ECCCR    CECCR    FL_FLASH_EnableDECC
  * @param    FLASHx FLASH instance
  * @param    key 
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableDECC(FLASH_Type* FLASHx)
{
    MODIFY_REG(FLASHx->ECCCR, (0xffU << 8U), (0x00 << 0U));
}

/**
  * @brief    
  * @rmtoll   ECCCR    CECCR    FL_FLASH_DisableDECC
  * @param    FLASHx FLASH instance
  * @retval   
  */
__STATIC_INLINE void FL_FLASH_DisableDECC(FLASH_Type* FLASHx)
{
    MODIFY_REG(FLASHx->ECCCR, (0xffU << 8U), (0xCC << 0U));
}

/**
  * @brief    
  * @rmtoll   ECCCR    CECCR    FL_FLASH_IsEnabledDECC
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledDECC(FLASH_Type* FLASHx)
{
    return (uint32_t)READ_BIT(FLASHx->ECCCR, FLASH_ECCCR_DECCR_Msk);
}

/**
  * @brief    
  * @rmtoll   DEPCR    ERTYPE    FL_FLASH_SetDataFLASHEraseType
  * @param    FLASHx FLASH instance
  * @param    type This parameter can be one of the following values:
  *           @arg @ref FL_FLASH_ERASE_TYPE_PAGE
  *           @arg @ref FL_FLASH_ERASE_TYPE_SECTOR
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_SetDataFLASHEraseType(FLASH_Type* FLASHx, uint32_t type)
{
    MODIFY_REG(FLASHx->DEPCR, FLASH_DEPCR_ERTYPE_Msk, type);
}

/**
  * @brief    
  * @rmtoll   DEPCR    ERTYPE    FL_FLASH_GetDataFLASHEraseType
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_FLASH_ERASE_TYPE_PAGE
  *           @arg @ref FL_FLASH_ERASE_TYPE_SECTOR
  */
__STATIC_INLINE uint32_t FL_FLASH_GetDataFLASHEraseType(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DEPCR, FLASH_DEPCR_ERTYPE_Msk));
}

/**
  * @brief    
  * @rmtoll   DEPCR    PREQ    FL_FLASH_EnableProgramInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableProgramInDataFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->DEPCR, FLASH_DEPCR_EREQ_Msk);
    SET_BIT(FLASHx->DEPCR, FLASH_DEPCR_PREQ_Msk);
}

/**
  * @brief    
  * @rmtoll   DEPCR    EREQ    FL_FLASH_EnableEraseInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableEraseInDataFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->DEPCR, FLASH_DEPCR_PREQ_Msk);
    SET_BIT(FLASHx->DEPCR, FLASH_DEPCR_EREQ_Msk);
}

/**
  * @brief    
  * @rmtoll   DKEY        FL_FLASH_UnlockDataFLASH
  * @param    FLASHx FLASH instance
  * @param    key 
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_UnlockDataFLASH(FLASH_Type* FLASHx, uint32_t key)
{
    WRITE_REG(FLASHx->DKEY, key); 
}

/**
  * @brief    
  * @rmtoll   DKEY        FL_FLASH_LockDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_LockDataFLASH(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->DKEY, 0xFFFFFFFF);
}

/**
  * @brief    
  * @rmtoll   DIER    LVIE    FL_FLASH_EnableIT_Voltage detectProgramErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_VoltageDetectProgramErrorInDataFLASH(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->DIER, FLASH_DIER_LVIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    LVIE    FL_FLASH_DisableIT_Voltage detectProgramErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_VoltageDetectProgramErrorInDataFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->DIER, FLASH_DIER_LVIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    LVIE    FL_FLASH_IsEnabledIT_Voltage detectProgramErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_VoltageDetectProgramErrorInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DIER, FLASH_DIER_LVIE_Msk) == FLASH_DIER_LVIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    OPTIE    FL_FLASH_EnableIT_OTPProgramErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_OTPProgramErrorInDataFLASH(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->DIER, FLASH_DIER_OPTIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    OPTIE    FL_FLASH_DisableIT_OTPProgramErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_OTPProgramErrorInDataFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->DIER, FLASH_DIER_OPTIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    OPTIE    FL_FLASH_IsEnabledIT_OTPProgramErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_OTPProgramErrorInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DIER, FLASH_DIER_OPTIE_Msk) == FLASH_DIER_OPTIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    AUTHIE    FL_FLASH_EnableIT_AuthenticationErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_EnableIT_AuthenticationErrorInDataFLASH(FLASH_Type* FLASHx)
{
    SET_BIT(FLASHx->DIER, FLASH_DIER_AUTHIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    AUTHIE    FL_FLASH_DisableIT_AuthenticationErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void FL_FLASH_DisableIT_AuthenticationErrorInDataFLASH(FLASH_Type* FLASHx)
{
    CLEAR_BIT(FLASHx->DIER, FLASH_DIER_AUTHIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    AUTHIE    FL_FLASH_IsEnabledIT_AuthenticationErrorInDataFLASH
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FLASH_IsEnabledIT_AuthenticationErrorInDataFLASH(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->DIER, FLASH_DIER_AUTHIE_Msk) == FLASH_DIER_AUTHIE_Msk);
}

